# Tips for mysql

This is the course material for 2025-2026 CS150A in Shanghaitech

Author：Yixi Zhou

**Reference:** Parts of this notebook are adapted from the course *CS639: Data Management for Data Science* at the University of Wisconsin–Madison.  
Source: [GitHub Repository](https://github.com/CS639-Data-Management-for-Data-Science/s25)

In [6]:
from sqlalchemy import create_engine, text
import pandas as pd
import os

In [2]:
engine = create_engine("mysql+mysqlconnector://root:123456@127.0.0.1:3306/cs150")
conn = engine.connect()

In [3]:
list(conn.execute(text("show tables;")))

[('Courses',), ('Enrolled',), ('Students',), ('songs',)]

## SQL 2: Basic SQL clauses

Let's drop all the tables that we created so far.

In [ ]:
# you have to drop the table with foreign key constraint first
conn.execute(text("drop table Enrolled"))
conn.execute(text("drop table Students"))
conn.execute(text("drop table Courses"))
conn.execute(text("drop table songs"))

In [3]:
list(conn.execute(text("show tables;")))

[]

### IMDB dataset

- Source: https://datasets.imdbws.com/ 
- Original dataset is too large to be analyzed using our current VM
- Schema information: https://developer.imdb.com/non-commercial-datasets/

Let's download a sampled version of the dataset.

In [50]:
!rm IMDB.zip
!rm *.tsv
!wget https://github.com/XanderZhou2022/ShanghaiTech_CS150A_2025fall/raw/refs/heads/main/data/IMDB.zip
!unzip IMDB.zip

--2025-09-18 18:01:50--  https://github.com/XanderZhou2022/ShanghaiTech_CS150A_2025fall/raw/refs/heads/main/data/IMDB.zip
Resolving github.com (github.com)... 100.64.0.41
Connecting to github.com (github.com)|100.64.0.41|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://raw.githubusercontent.com/XanderZhou2022/ShanghaiTech_CS150A_2025fall/refs/heads/main/data/IMDB.zip [following]
--2025-09-18 18:01:51--  https://raw.githubusercontent.com/XanderZhou2022/ShanghaiTech_CS150A_2025fall/refs/heads/main/data/IMDB.zip
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 2606:50c0:8003::154, 2606:50c0:8001::154, 2606:50c0:8002::154, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|2606:50c0:8003::154|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 584293 (571K) [application/zip]
Saving to: ‘IMDB.zip’

IMDB.zip            100%[===================>] 570.60K  1.68MB/s    in 0.3s

2025-09-18 18:01:53 (1.68 MB/s) - ‘IMDB.zip’ saved [584293/584293]

Archive:  IMDB.zip
  inflating: name.basics.tsv
  inflating: title.akas.tsv
  inflating: title.basics.tsv
  inflating: title.crew.tsv
  inflating: title.episode.tsv
  inflating: title.principals.tsv
  inflating: title.ratings.tsv

#### Populating MySQL server with tables corresponding to all tsv files

In [7]:
files = os.listdir()
tsv_files = [f for f in files if ".tsv" in f]
table_names = [f.replace(".tsv", "") for f in tsv_files]
table_names = [f.replace(".", "_") for f in table_names]

In [8]:
for idx, tsv_file in enumerate(tsv_files):
    df = pd.read_csv(tsv_file, sep="\t", na_values='\\N')
    df.to_sql(table_names[idx], conn, index=False, if_exists="replace")
    print(f"Populated {table_names[idx]}")

Populated title_ratings
Populated title_principals
Populated title_akas
Populated name_basics
Populated title_basics
Populated title_episode
Populated title_crew

In [9]:
list(conn.execute(text("show tables;")))

[('name_basics',),
 ('title_akas',),
 ('title_basics',),
 ('title_crew',),
 ('title_episode',),
 ('title_principals',),
 ('title_ratings',)]

### Explore the tables

In [10]:
# name_basics
pd.read_sql("SELECT * FROM name_basics LIMIT 5", conn)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm7644510,Valentin Malaescu,NaN,NaN,actor,tt5072918
1,nm4867615,Christopher Heimann,NaN,NaN,miscellaneous,tt2198043
2,nm0912420,Natalie Denise Sperl,NaN,NaN,"actress,director,producer","tt10618286,tt10750482,tt12200650,tt0369179"
3,nm6994121,Amie Stephens,NaN,NaN,art_department,"tt1957938,tt2945374"
4,nm0171239,Tom Coleman,1907.0,1978.0,"art_department,production_designer,set_decorator","tt0051221,tt0047879,tt0055992,tt0050000"

In [11]:
pd.read_sql("SELECT * FROM name_basics LIMIT 5", conn)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm7644510,Valentin Malaescu,NaN,NaN,actor,tt5072918
1,nm4867615,Christopher Heimann,NaN,NaN,miscellaneous,tt2198043
2,nm0912420,Natalie Denise Sperl,NaN,NaN,"actress,director,producer","tt10618286,tt10750482,tt12200650,tt0369179"
3,nm6994121,Amie Stephens,NaN,NaN,art_department,"tt1957938,tt2945374"
4,nm0171239,Tom Coleman,1907.0,1978.0,"art_department,production_designer,set_decorator","tt0051221,tt0047879,tt0055992,tt0050000"

**Warning: You can see that although I have done two LIMIT operation, the order doesn't change!**

This is one question from Sep.15 class.

In [12]:
# title_akas
pd.read_sql("SELECT * FROM title_akas LIMIT 5", conn)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000912,1,The Indian Runner's Romance,None,None,original,None,1
1,tt0000912,2,The Indian Runner's Romance,US,None,imdbDisplay,None,0
2,tt0000912,3,Любовь индейского бегуна,RU,None,imdbDisplay,None,0
3,tt0013001,1,The Cashier,None,None,original,None,1
4,tt0013001,2,The Cashier,US,None,imdbDisplay,None,0

In [13]:
# title_basics
pd.read_sql("SELECT * FROM title_basics LIMIT 5", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000912,short,The Indian Runner's Romance,The Indian Runner's Romance,0,1909.0,None,11.0,"Short,Western"
1,tt0013001,short,The Cashier,The Cashier,0,1922.0,None,NaN,"Animation,Comedy,Short"
2,tt0016344,movie,Shirayuri wa nageku,Shirayuri wa nageku,0,1925.0,None,NaN,None
3,tt0017504,movie,Unseen Enemies,Unseen Enemies,0,1925.0,None,54.0,Western
4,tt0024996,movie,Coming Out Party,Coming Out Party,0,1934.0,None,80.0,Drama

In [14]:
# title_crew
pd.read_sql("SELECT * FROM title_crew LIMIT 5", conn)

      tconst  directors                        writers
0  tt0000912  nm0000428                      nm0853193
1  tt0013001  nm0279404                      nm0279404
2  tt0016344  nm0003226                      nm0793684
3  tt0017504  nm0569645                           None
4  tt0024996  nm0090007  nm0306731,nm0881148,nm0489679

In [15]:
# title_episode
pd.read_sql("SELECT * FROM title_episode LIMIT 5", conn)

      tconst parentTconst  seasonNumber  episodeNumber
0  tt0084769    tt0806910           1.0          140.0
1  tt0162689    tt0806910           1.0          203.0
2  tt0394320    tt0096542           2.0           18.0
3  tt0465362    tt0388656           NaN            NaN
4  tt0504908    tt0285351           3.0           16.0

In [16]:
# title_principals
pd.read_sql("SELECT * FROM title_principals LIMIT 5", conn)

      tconst  ordering     nconst category   job              characters
0  tt0000912         1  nm0601698    actor  None          ["Blue Cloud"]
1  tt0000912         2  nm0288616    actor  None  ["The Old Prospector"]
2  tt0000912         3  nm0681933  actress  None   ["Blue Cloud's Wife"]
3  tt0000912         4  nm0424530    actor  None              ["Cowboy"]
4  tt0000912         5  nm0456804    actor  None              ["Cowboy"]

In [17]:
# title_ratings
pd.read_sql("SELECT * FROM title_ratings LIMIT 5", conn)

      tconst  averageRating  numVotes
0  tt0000912            4.3        73
1  tt0017504            4.8        27
2  tt0024996            5.9        66
3  tt0029553            6.0        45
4  tt0030476            6.2        81

### Data Analysis

#### Q1: What are the movies?

In [18]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE titleType = 'movie'
""", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0016344,movie,Shirayuri wa nageku,Shirayuri wa nageku,0,1925.0,None,NaN,None
1,tt0017504,movie,Unseen Enemies,Unseen Enemies,0,1925.0,None,54.0,Western
2,tt0024996,movie,Coming Out Party,Coming Out Party,0,1934.0,None,80.0,Drama
3,tt0029553,movie,The Sheik Steps Out,The Sheik Steps Out,0,1937.0,None,65.0,Musical
4,tt0035860,movie,The Fallen Sparrow,The Fallen Sparrow,0,1943.0,None,94.0,"Film-Noir,Mystery"
...,...,...,...,...,...,...,...,...,...
183,tt8787458,movie,Gado,Gado,0,NaN,None,NaN,Western
184,tt8906732,movie,A Song or Two to Make You Feel,A Song or Two to Make You Feel,0,2018.0,None,54.0,Music
185,tt9198442,movie,My Hero Academia,My Hero Academia,0,NaN,None,NaN,"Action,Adventure,Animation"
186,tt9642604,movie,Los hombres sin rostros,Los hombres sin rostros,0,2016.0,None,59.0,Documentary
187,tt9653828,movie,Arest,Arest,0,2019.0,None,126.0,Drama

#### Q2: What are all the movie titles and their corresponding release years? Eliminate movies without release years.

Which table can we find this data from?

In [19]:
pd.read_sql("""
    SELECT primaryTitle, startYear
    FROM title_basics
    WHERE titleType = 'movie' AND startYear IS NOT NULL
""", conn)

                       primaryTitle  startYear
0               Shirayuri wa nageku     1925.0
1                    Unseen Enemies     1925.0
2                  Coming Out Party     1934.0
3               The Sheik Steps Out     1937.0
4                The Fallen Sparrow     1943.0
..                              ...        ...
155                   Ordinary Gods     2019.0
156                Making Masculine     2018.0
157  A Song or Two to Make You Feel     2018.0
158         Los hombres sin rostros     2016.0
159                           Arest     2019.0

[160 rows x 2 columns]

#### Q3: How many movies are in this dataset?

In [20]:
pd.read_sql("""
    SELECT COUNT(*) AS TotalMovies
    FROM title_basics
    WHERE titleType = 'movie'
""", conn)

   TotalMovies
0          188

#### Q4: What are all the types of titles in this dataset?

In [21]:
pd.read_sql("""
    SELECT DISTINCT titleType
    FROM title_basics
""", conn)

      titleType
0         short
1         movie
2      tvSeries
3       tvMovie
4     tvEpisode
5  tvMiniSeries
6         video
7     tvSpecial
8     videoGame
9       tvShort

#### Q5: How many title types are there in this dataset?

In [22]:
pd.read_sql("""
    SELECT COUNT(DISTINCT titleType)
    FROM title_basics
""", conn)

   COUNT(DISTINCT titleType)
0                         10

#### Q6: What are all the movies that got released in 2023?

In [23]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE titleType = 'movie' AND startYear = 2023 
""", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt24423974,movie,Dilated Pupils,Dilated Pupils,0,2023.0,None,NaN,"Crime,Drama"
1,tt28114581,movie,Tebus the Movie,Tebus the Movie,0,2023.0,None,114.0,Action
2,tt29521112,movie,"Internet, fais-moi peur!","Internet, fais-moi peur!",0,2023.0,None,50.0,"Comedy,Documentary,Horror"
3,tt29545081,movie,50 Horizons,50 Horizons,0,2023.0,None,77.0,Documentary
4,tt31868404,movie,Mother Lear,Mother Lear,0,2023.0,None,57.0,Drama

#### Q7: What is the average rating of all titles?

In [24]:
pd.read_sql("""
    SELECT AVG(averageRating) AS avg_movie_rating
    FROM title_ratings
""", conn)

   avg_movie_rating
0          6.950386

#### Q8: What are all the movies that have runtime greater than 2 hours?

In [25]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE runtimeMinutes > 120 and titleType = 'movie'
""", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0173156,movie,Saajan Ka Ghar,Saajan Ka Ghar,0,1994.0,None,153.0,Drama
1,tt0217355,movie,Dancing at the Blue Iguana,Dancing at the Blue Iguana,0,2000.0,None,123.0,"Drama,Mystery"
2,tt11731926,movie,Cock Tail,Cock Tail,0,2020.0,None,132.0,Comedy
3,tt11875038,movie,Dream,Dream,0,2012.0,None,126.0,Thriller
4,tt1242755,movie,MW,MW,0,2009.0,None,129.0,"Drama,Thriller"
5,tt1954818,movie,Shatru,Shatru,0,2011.0,None,150.0,"Action,Crime,Drama"
6,tt5439126,movie,Manam Kothi Paravai,Manam Kothi Paravai,0,2012.0,None,137.0,"Comedy,Romance"
7,tt7247336,movie,Natha Pure Aata,Natha Pure Aata,0,2006.0,None,139.0,Comedy
8,tt9653828,movie,Arest,Arest,0,2019.0,None,126.0,Drama

#### Q9: What are all the "Comedy" movies?

In [26]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE genres LIKE "%Comedy%" 
""", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0013001,short,The Cashier,The Cashier,0,1922.0,NaN,NaN,"Animation,Comedy,Short"
1,tt0030476,short,Music Made Simple,Music Made Simple,0,1938.0,NaN,8.0,"Comedy,Short"
2,tt0042171,tvSeries,You Bet Your Life,You Bet Your Life,0,1950.0,1961.0,30.0,"Comedy,Family,Game-Show"
3,tt0047851,movie,Ball at the Savoy,Ball im Savoy,0,1955.0,NaN,96.0,"Comedy,Musical"
4,tt0051822,movie,Klarar Bananen Biffen?,Klarar Bananen Biffen?,0,1957.0,NaN,94.0,Comedy
...,...,...,...,...,...,...,...,...,...
577,tt9666158,tvEpisode,Episode #3.38,Episode #3.38,0,2008.0,NaN,NaN,"Comedy,Drama,Romance"
578,tt9666256,tvEpisode,Episode #1.35,Episode #1.35,0,2006.0,NaN,NaN,"Comedy,Drama,Romance"
579,tt9743542,tvEpisode,Episode dated 2 September 2018,Episode dated 2 September 2018,0,2018.0,NaN,NaN,"Comedy,Talk-Show"
580,tt9776232,tvEpisode,Múmia do Amor,Múmia do Amor,0,2016.0,NaN,NaN,"Adventure,Animation,Comedy"
581,tt9854186,tvEpisode,Casino Royale Pitch Meeting: Introducing The B...,Casino Royale Pitch Meeting: Introducing The B...,0,2019.0,NaN,NaN,Comedy

#### Q10: Find the total number of people in the dataset.

In [27]:
pd.read_sql("""
    SELECT COUNT(*) AS totalPeople
    FROM name_basics
""", conn)

   totalPeople
0         2762

#### Q11: What are the distinct primary professions of individuals in the dataset?

In [28]:
pd.read_sql("""
    SELECT DISTINCT primaryProfession
    FROM name_basics
    WHERE primaryProfession IS NOT NULL
""", conn)

                                    primaryProfession
0                                               actor
1                                       miscellaneous
2                           actress,director,producer
3                                      art_department
4    art_department,production_designer,set_decorator
..                                                ...
415                              actor,art_department
416                        editorial_department,actor
417                 writer,actor,editorial_department
418                    visual_effects,director,editor
419                    sound_department,miscellaneous

[420 rows x 1 columns]

#### Q12: What are the total number of alternate titles listed in the dataset?

In [29]:
pd.read_sql("""
    SELECT COUNT(*) AS totalAlternateTitles
    FROM title_akas;
""", conn)

   totalAlternateTitles
0                 12421

#### Q13: What is the total runtime in the dataset?

In [30]:
pd.read_sql("""
    SELECT SUM(runtimeMinutes) AS totalRuntime
    FROM title_basics
    WHERE runtimeMinutes IS NOT NULL;
""", conn)

   totalRuntime
0       38396.0

#### Q14: What are the regions where alternate titles are available?

In [31]:
pd.read_sql("""
    SELECT DISTINCT region
    FROM title_akas
    WHERE region IS NOT NULL;
""", conn)

   region
0      US
1      RU
2      ES
3      FR
4     XWW
..    ...
75     PK
76     HT
77     MG
78     DO
79     KP

[80 rows x 1 columns]

#### Q15: List the titles of movies along with their runtimes converted from minutes to hours.

In [32]:
pd.read_sql("""
    SELECT 
        primaryTitle, runtimeMinutes, 
        runtimeMinutes / 60 AS runTimeHours
    FROM title_basics
    WHERE titleType = "movie" AND runtimeMinutes IS NOT NULL;
""", conn)

                       primaryTitle  runtimeMinutes  runTimeHours
0                    Unseen Enemies            54.0      0.900000
1                  Coming Out Party            80.0      1.333333
2               The Sheik Steps Out            65.0      1.083333
3                The Fallen Sparrow            94.0      1.566667
4                 Oath of Vengeance            57.0      0.950000
..                              ...             ...           ...
117                   Ordinary Gods           107.0      1.783333
118                Making Masculine            51.0      0.850000
119  A Song or Two to Make You Feel            54.0      0.900000
120         Los hombres sin rostros            59.0      0.983333
121                           Arest           126.0      2.100000

[122 rows x 3 columns]

#### Q16: What are all movies that got released between 2000 and 2010, inclusive?

In [33]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE titleType = "movie" AND startYear BETWEEN 2000 AND 2010
""", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0128154,movie,Daybreak,Daybreak,0,2002.0,None,87.0,"Crime,Mystery,Thriller"
1,tt0217355,movie,Dancing at the Blue Iguana,Dancing at the Blue Iguana,0,2000.0,None,123.0,"Drama,Mystery"
2,tt0228992,movie,An Outgoing Woman,Une femme d'extérieur,0,2000.0,None,118.0,Drama
3,tt0268446,movie,Mask of Desire,Mukundo,0,2000.0,None,105.0,Drama
4,tt0326988,movie,I'll Sing for You,Je chanterai pour toi,0,2001.0,None,76.0,"Biography,Documentary,Drama"
5,tt0337857,movie,The Beat,The Beat,0,2003.0,None,85.0,"Action,Comedy,Drama"
6,tt0349688,movie,A Little Bit of Freedom,Kleine Freiheit,0,2003.0,None,102.0,Drama
7,tt0354836,movie,Podium,Podium,0,2004.0,None,95.0,"Comedy,Music"
8,tt0430891,movie,Aria,Aria,0,2004.0,None,57.0,Drama
9,tt0446789,movie,Standalone,Standalone,0,2005.0,None,108.0,"Action,Crime,Drama"
10,tt0463992,movie,Finish Line: A Cruise Down Memory Lane,Finish Line: A Cruise Down Memory Lane,0,2005.0,None,NaN,Drama
11,tt0469695,movie,You Bet Your Life,Spiele Leben,0,2005.0,None,98.0,"Drama,Thriller"
12,tt0472465,movie,Infection,Infection,0,2005.0,None,81.0,Horror
13,tt0481069,movie,Budapest Retro 2.,Budapest Retro 2.,0,2003.0,None,90.0,Documentary
14,tt0486523,movie,El último país mágico,El último país mágico,0,2005.0,None,45.0,Documentary
15,tt0781515,movie,Suzanne,Suzanne,0,2006.0,None,92.0,Comedy
16,tt0847577,movie,See You at the Altar,See You at the Altar,0,2006.0,None,90.0,"Comedy,Romance"
17,tt0882816,movie,"Tovarisch, I Am Not Dead","Tovarisch, I Am Not Dead",0,2007.0,None,85.0,"Biography,Documentary,War"
18,tt0933342,movie,Polycarp,Polycarp,0,2007.0,None,85.0,"Crime,Horror,Romance"
19,tt1087526,movie,Tandoori Love,Tandoori Love,0,2008.0,None,100.0,"Comedy,Drama,Romance"
20,tt1181934,movie,Speakerman: The Boo,Supîkâman: The Boo,0,2004.0,None,77.0,Fantasy
21,tt1242755,movie,MW,MW,0,2009.0,None,129.0,"Drama,Thriller"
22,tt1356799,movie,Kakolyri 5/44... I istoria mias meras,Kakolyri 5/44... I istoria mias meras,0,2005.0,None,75.0,"Documentary,History"
23,tt13789606,movie,Adhu,Adhu,0,2004.0,None,NaN,"Drama,Horror,Mystery"
24,tt13879778,movie,Tv till varje pris - en film om Lasse Holmqvist,Tv till varje pris - en film om Lasse Holmqvist,0,2007.0,None,58.0,None
25,tt1419916,movie,Chowrasta Crossroads of Love,Chowrasta Crossroads of Love,0,2009.0,None,120.0,Drama
26,tt1466511,movie,The Four Questions,The Four Questions,0,2009.0,None,63.0,Comedy
27,tt1500724,movie,Kakraki,Kakraki,0,2009.0,None,105.0,"Comedy,Drama"
28,tt1526636,movie,Romane Paramisa,Romane Paramisa,0,2009.0,None,116.0,"Documentary,Drama"
29,tt1740705,movie,Titans of Yoga,Titans of Yoga,0,2010.0,None,68.0,Documentary
30,tt5254990,movie,"Wild Horses, Unconquered People","Wild Horses, Unconquered People",0,2004.0,None,NaN,Documentary
31,tt7247336,movie,Natha Pure Aata,Natha Pure Aata,0,2006.0,None,139.0,Comedy

### SQL Subqueries

#### Q17: What is the shortest movie released after 2010?

In [34]:
pd.read_sql("""
    SELECT MIN(runtimeMinutes)
    FROM title_basics
    WHERE startYear > 2010 AND titleType = 'movie' AND runtimeMinutes IS NOT NULL
""", conn)

   MIN(runtimeMinutes)
0                 49.0

In [35]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE runtimeMinutes = (
        SELECT MIN(runtimeMinutes)
        FROM title_basics
        WHERE startYear > 2010 AND titleType = 'movie' AND runtimeMinutes IS NOT NULL
    ) AND titleType = 'movie'
""", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt21992428,movie,Static! The Rockumentary,Static! The Rockumentary,0,2022.0,None,49.0,Documentary

#### Q18: What is the longest movie released after 2010?

In [36]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE runtimeMinutes = (
        SELECT MAX(runtimeMinutes)
        FROM title_basics
        WHERE startYear > 2010 AND titleType = 'movie' AND runtimeMinutes IS NOT NULL
    ) AND titleType = 'movie'
""", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt1954818,movie,Shatru,Shatru,0,2011.0,None,150.0,"Action,Crime,Drama"

#### Q19: What are the titles that have a runtime greater than the average runtime of all movies?

In [37]:
pd.read_sql("""
    SELECT AVG(runtimeMinutes)
    FROM title_basics
    WHERE runtimeMinutes IS NOT NULL
""", conn)

   AVG(runtimeMinutes)
0            42.008753

In [38]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE runtimeMinutes > (
        SELECT AVG(runtimeMinutes)
        FROM title_basics
        WHERE runtimeMinutes IS NOT NULL
)
""", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0017504,movie,Unseen Enemies,Unseen Enemies,0,1925.0,NaN,54.0,Western
1,tt0024996,movie,Coming Out Party,Coming Out Party,0,1934.0,NaN,80.0,Drama
2,tt0029553,movie,The Sheik Steps Out,The Sheik Steps Out,0,1937.0,NaN,65.0,Musical
3,tt0035860,movie,The Fallen Sparrow,The Fallen Sparrow,0,1943.0,NaN,94.0,"Film-Noir,Mystery"
4,tt0037142,movie,Oath of Vengeance,Oath of Vengeance,0,1944.0,NaN,57.0,Western
...,...,...,...,...,...,...,...,...,...
355,tt9653828,movie,Arest,Arest,0,2019.0,NaN,126.0,Drama
356,tt9654270,tvSeries,Giardino d'inverno,Giardino d'inverno,0,1961.0,1961.0,120.0,Comedy
357,tt9685774,tvMovie,The Farewell Girls,The Farewell Girls,0,2017.0,NaN,86.0,Drama
358,tt9728774,tvSeries,Innocent the Bhola,Innocent the Bhola,0,2020.0,NaN,98.0,Thriller
359,tt9796264,tvEpisode,Alt for Noreg,Alt for Noreg,0,2019.0,NaN,45.0,"Drama,Sport"

#### Q20: What are the most recent movies?

In [39]:
pd.read_sql("""
    SELECT MAX(startYear)
    FROM title_basics
    WHERE titleType = 'movie'
""", conn)

   MAX(startYear)
0          2024.0

In [40]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE startYear = (
        SELECT MAX(startYear)
        FROM title_basics
        WHERE titleType = 'movie'
    ) AND titleType = 'movie'
""", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt16311360,movie,Krzyk: Losing Control,Krzyk: Losing Control,0,2024.0,None,80.0,"Drama,Thriller"
1,tt29009061,movie,Amici per caso,Amici per caso,0,2024.0,None,95.0,Comedy
2,tt32848875,movie,Dad and I - Chapter 1: The Life of Timothy J. ...,Dad and I - Chapter 1: The Life of Timothy J. ...,0,2024.0,None,111.0,Biography

#### Q21: Find the number of movies that have more than one genre.

We can find number of genres by simply counting number of commas and adding 1 to that count. Let's first determine length of genres column.

In [41]:
pd.read_sql("""
    SELECT genres, LENGTH(genres)
    FROM title_basics
""", conn)

                      genres  LENGTH(genres)
0              Short,Western            13.0
1     Animation,Comedy,Short            22.0
2                       None             NaN
3                    Western             7.0
4                      Drama             5.0
...                      ...             ...
2769                   Drama             5.0
2770            Family,Short            12.0
2771               Game-Show             9.0
2772                  Comedy             6.0
2773             Documentary            11.0

[2774 rows x 2 columns]

To find, number of commas, we can replace commas with nothing and find difference between original string and the replaced string.

In [42]:
pd.read_sql("""
    SELECT genres, LENGTH(genres) - LENGTH(REPLACE(genres, ',', '')) + 1
    FROM title_basics
""", conn)

,genres,"LENGTH(genres) - LENGTH(REPLACE(genres, ',', '')) + 1"
0,"Short,Western",2.0
1,"Animation,Comedy,Short",3.0
2,None,NaN
3,Western,1.0
4,Drama,1.0
...,...,...
2769,Drama,1.0
2770,"Family,Short",2.0
2771,Game-Show,1.0
2772,Comedy,1.0
2773,Documentary,1.0

Now putting it together in a subquery.

In [43]:
pd.read_sql("""
    SELECT COUNT(*)
    FROM title_basics
    WHERE (
        SELECT LENGTH(genres) - LENGTH(REPLACE(genres, ',', '')) + 1
    ) > 1;
""", conn)

   COUNT(*)
0      1181

#### Q22: Find the titles of movies that have the maximum number of genres.

In [44]:
pd.read_sql("""
    SELECT primaryTitle, genres
    FROM title_basics
    WHERE (
        SELECT LENGTH(genres) - LENGTH(REPLACE(genres, ',', '')) + 1
    ) = (
        SELECT MAX(LENGTH(genres) - LENGTH(REPLACE(genres, ',', '')) + 1)
        FROM title_basics
    )
""", conn)

                      primaryTitle                      genres
0                      The Cashier      Animation,Comedy,Short
1                You Bet Your Life     Comedy,Family,Game-Show
2              Return of the Seven        Action,Drama,Western
3                       Kindergeld         Crime,Drama,Mystery
4                         Mindwarp      Horror,Sci-Fi,Thriller
..                             ...                         ...
442  Episode dated 21 January 2019  Documentary,News,Talk-Show
443  Episode dated 5 November 2018  Documentary,News,Talk-Show
444              Frozen and Afraid  Adventure,Game-Show,Horror
445                  Múmia do Amor  Adventure,Animation,Comedy
446                 Episode #1.372          Action,Crime,Drama

[447 rows x 2 columns]

#### Q23: Find the titles of movies that belong to the same genres as those with a runtime longer than 150 minutes.

In [45]:
pd.read_sql("""
    SELECT genres
    FROM title_basics
    WHERE titleType = "movie" AND runtimeMinutes > 150 AND genres IS NOT NULL
""", conn)

  genres
0  Drama

In [46]:
pd.read_sql("""
    SELECT *
    FROM title_basics
    WHERE genres IN (
        SELECT genres
        FROM title_basics
        WHERE titleType = "movie" AND runtimeMinutes > 150 AND genres IS NOT NULL
)
""", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0024996,movie,Coming Out Party,Coming Out Party,0,1934.0,NaN,80.0,Drama
1,tt0084219,tvMovie,Die Komplizen,Die Komplizen,0,1985.0,NaN,NaN,Drama
2,tt0098516,movie,Trois pommes à côté du sommeil,Trois pommes à côté du sommeil,0,1989.0,NaN,98.0,Drama
3,tt0101806,tvMovie,Elsa,Elsa,0,1991.0,NaN,105.0,Drama
4,tt0173156,movie,Saajan Ka Ghar,Saajan Ka Ghar,0,1994.0,NaN,153.0,Drama
...,...,...,...,...,...,...,...,...,...
292,tt9655972,tvEpisode,Episode #1.151,Episode #1.151,0,2017.0,NaN,NaN,Drama
293,tt9685774,tvMovie,The Farewell Girls,The Farewell Girls,0,2017.0,NaN,86.0,Drama
294,tt9768578,tvEpisode,Episode #1.701,Episode #1.701,0,2012.0,NaN,NaN,Drama
295,tt9801116,tvEpisode,Episode #1.308,Episode #1.308,0,2010.0,NaN,NaN,Drama
296,tt9836540,tvEpisode,Episode #1.48,Episode #1.48,0,2010.0,NaN,NaN,Drama

### JOINs

#### Q24: Find all movies and their corresponding ratings.

In [47]:
pd.read_sql("""
    SELECT b.primaryTitle, r.averageRating
    FROM title_basics b
    JOIN title_ratings r ON b.tconst = r.tconst
    WHERE b.titleType = 'movie'
""", conn)

                                  primaryTitle  averageRating
0                               Unseen Enemies            4.8
1                             Coming Out Party            5.9
2                          The Sheik Steps Out            6.0
3                           The Fallen Sparrow            6.6
4                            Oath of Vengeance            5.7
..                                         ...            ...
90  Horror, Madness & Mayhem Vol 1 Snuff Party            7.2
91                             Natha Pure Aata            4.9
92                               Ordinary Gods            8.5
93                     Los hombres sin rostros            6.8
94                                       Arest            7.4

[95 rows x 2 columns]

#### Q25: List all movies and their associated genres.

In [48]:
pd.read_sql("""
    SELECT b.primaryTitle, b.genres
    FROM title_basics b
    LEFT JOIN title_akas a ON b.tconst = a.titleId;
""", conn)

                         primaryTitle                      genres
0         The Indian Runner's Romance               Short,Western
1         The Indian Runner's Romance               Short,Western
2         The Indian Runner's Romance               Short,Western
3                         The Cashier      Animation,Comedy,Short
4                         The Cashier      Animation,Comedy,Short
...                               ...                         ...
12424  Episode dated 2 September 2018            Comedy,Talk-Show
12425  Episode dated 2 September 2018            Comedy,Talk-Show
12426  Episode dated 2 September 2018            Comedy,Talk-Show
12427               Frozen and Afraid  Adventure,Game-Show,Horror
12428               Frozen and Afraid  Adventure,Game-Show,Horror

[12429 rows x 2 columns]

#### Q26: Find all crew members and the movies they worked on.

In [49]:
pd.read_sql("""
    SELECT *
    FROM title_crew c
    RIGHT JOIN title_basics b ON c.tconst = b.tconst
""", conn)

,tconst,directors,writers,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000912,nm0000428,nm0853193,tt0000912,short,The Indian Runner's Romance,The Indian Runner's Romance,0,1909.0,NaN,11.0,"Short,Western"
1,tt0013001,nm0279404,nm0279404,tt0013001,short,The Cashier,The Cashier,0,1922.0,NaN,NaN,"Animation,Comedy,Short"
2,tt0016344,nm0003226,nm0793684,tt0016344,movie,Shirayuri wa nageku,Shirayuri wa nageku,0,1925.0,NaN,NaN,None
3,tt0017504,nm0569645,None,tt0017504,movie,Unseen Enemies,Unseen Enemies,0,1925.0,NaN,54.0,Western
4,tt0024996,nm0090007,"nm0306731,nm0881148,nm0489679",tt0024996,movie,Coming Out Party,Coming Out Party,0,1934.0,NaN,80.0,Drama
...,...,...,...,...,...,...,...,...,...,...,...,...
2769,tt9836540,"nm1516005,nm8498176,nm4443289","nm9494566,nm2761502,nm6945450",tt9836540,tvEpisode,Episode #1.48,Episode #1.48,0,2010.0,NaN,NaN,Drama
2770,tt9837390,None,None,tt9837390,tvEpisode,Customizable Emoji Shirt,Customizable Emoji Shirt,0,2019.0,NaN,NaN,"Family,Short"
2771,tt9847426,nm1227859,nm0341311,tt9847426,tvEpisode,All Star Games 4,All Star Games 4,0,2019.0,NaN,30.0,Game-Show
2772,tt9854186,None,None,tt9854186,tvEpisode,Casino Royale Pitch Meeting: Introducing The B...,Casino Royale Pitch Meeting: Introducing The B...,0,2019.0,NaN,NaN,Comedy
2773,tt9910216,None,"nm10515764,nm10515763,nm10518788,nm10515765",tt9910216,tvEpisode,Episode #1.3,Episode #1.3,0,1981.0,NaN,NaN,Documentary